1s/ERP/extensions/liko/Catalogs/ЯССМ_ОбъектыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЯССМ_ОбъектыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Нарезка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Втулка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Втулки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Уникальный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмеренияУУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерПоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Рулонный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаименованиеКороткое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КодНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Категория2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КатегорияТовара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерБланка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаФормирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УпотребитьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидКонтактаСПищевойПродукцией</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ВидыКонтактовСПищевойПродукцией</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОстаточныйСрокГодности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/extensions/liko/CommonModules/Лико_СкладыКлиент/Ext/Module.bsl
Процедура ЗаполнениеУпаковкиПоХарактеристики (Форма,Элемент) Экспорт //+Лико m.shenderov 09.11.2017
	
	Характеристика	=Форма.Элементы.Товары.ТекущиеДанные.Характеристика;
	Нарезка			=Лико_СкладыВызовСервера.ПолучитьНарезку(Характеристика);
	//Серия			=Форма.Элементы.Товары.ТекущиеДанные.Серия;
	Форма.Элементы.Товары.ТекущиеДанные.Упаковка=Неопределено;
	Если ЗначениеЗаполнено(Нарезка) Тогда
		Форма.Элементы.Товары.ТекущиеДанные.Упаковка=Лико_СкладыВызовСервера.ПолучитьУпаковку(Нарезка);	
	КонецЕсли;	
КонецПроцедуры //-Лико m.shenderov 09.11.2017

&НаКлиенте 
Процедура ПоказатьФормуОбъектаНоменклатуры(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка,Имя="ТоварыСерияИмяКороткое") Экспорт  //+Лико m.shenderov 16.12.2017


	Если Поле.Имя=Имя Тогда
		СтандартнаяОбработка=Ложь;  		 
		ОбъектНоменклатуры=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Элемент.ТекущиеДанные.Серия,"ЯССМ_ОбъектНоменклатуры");
		
		Если ЗначениеЗаполнено(ОбъектНоменклатуры) Тогда 			
			Структура = Новый Структура;
			Структура.Вставить("Ключ",ОбъектНоменклатуры);
			ОткрытьФорму("Справочник.ЯССМ_ОбъектыНоменклатуры.Форма.ФормаЭлемента",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		КонецЕсли; 		
	КонецЕсли;
	Если Поле.Имя="ТоварыСерия" Тогда
		СтандартнаяОбработка=Ложь;  		 
		
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Серия) Тогда 			
			Структура = Новый Структура;
			Структура.Вставить("Ключ",Элемент.ТекущиеДанные.Серия);
			ОткрытьФорму("Справочник.СерииНоменклатуры.Форма.ФормаЭлемента",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		КонецЕсли; 		
	КонецЕсли;

	

		
КонецПроцедуры //-Лико m.shenderov 16.12.2017


&НаКлиенте
Процедура ОткрытьОтчетПоОстаткам(ТекСтр) Экспорт //+Лико m.shenderov 26.12.2017
	КомпоновщикНастроек=Лико_ОбщегоНазначенияСервер.ПолучитьКомпановщикЛикоОстаткиТоваров();

Если ТекСтр=Неопределено Тогда
	Возврат;
КонецЕсли;

	Для каждого Отбор Из  КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			Если Отбор.ЛевоеЗначение= Новый ПолеКомпоновкиДанных("Номенклатура") Тогда				
				ОтборНоменклатуры=КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Отбор.ИдентификаторПользовательскойНастройки);
				ОтборНоменклатуры.ПравоеЗначение= ТекСтр.Номенклатура;
				ОтборНоменклатуры.Использование=Истина;
			КонецЕсли;
			Если Отбор.ЛевоеЗначение= Новый ПолеКомпоновкиДанных("Характеристика.ЯССМ_Нарезка") Тогда				
				ОтборНоменклатуры=КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Отбор.ИдентификаторПользовательскойНастройки);
				ОтборНоменклатуры.ПравоеЗначение= ТекСтр.Нарезка;
				ОтборНоменклатуры.Использование=Истина;
			КонецЕсли;	
			
			Если Отбор.ЛевоеЗначение= Новый ПолеКомпоновкиДанных("Номенклатура.Код") Тогда				
				ОтборНоменклатуры=КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Отбор.ИдентификаторПользовательскойНастройки);
				ОтборНоменклатуры.ПравоеЗначение="";
				ОтборНоменклатуры.Использование=Ложь;
			КонецЕсли;	
			
			Если Отбор.ЛевоеЗначение= Новый ПолеКомпоновкиДанных("Номенклатура.Артикул") Тогда				
				ОтборНоменклатуры=КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Отбор.ИдентификаторПользовательскойНастройки);
				ОтборНоменклатуры.ПравоеЗначение="";
				ОтборНоменклатуры.Использование=Ложь;
			КонецЕсли;	
			
			
			Если Отбор.ЛевоеЗначение= Новый ПолеКомпоновкиДанных("Объектноменклатуры") Тогда				
				ОтборНоменклатуры=КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Отбор.ИдентификаторПользовательскойНастройки);
				ОтборНоменклатуры.ПравоеЗначение="";
				ОтборНоменклатуры.Использование=Ложь;
			КонецЕсли;	
			
			
			Если Отбор.ЛевоеЗначение= Новый ПолеКомпоновкиДанных("Номенклатура.ЦеноваяГруппа.Код") Тогда				
				ОтборНоменклатуры=КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Отбор.ИдентификаторПользовательскойНастройки);
				ОтборНоменклатуры.ПравоеЗначение="";
				ОтборНоменклатуры.Использование=Ложь;
			КонецЕсли;			
		КонецЦикла; 
		
		Для каждого ТекЭлемент Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			Если ТипЗнч(ТекЭлемент)= Тип("ГруппировкаКомпоновкиДанных")Тогда
				ТекЭлемент.Использование=Ложь;
			КонецЕсли;
			

		КонецЦикла;
	      

Структура = Новый Структура;
Структура.Вставить("СформироватьПриОткрытии",Истина);
Структура.Вставить("ПользовательскиеНастройки",КомпоновщикНастроек.ПользовательскиеНастройки);

ОткрытьФорму("Отчет.ЛикоОстаткиТоваров.Форма.ФормаОтчета",Структура);

КонецПроцедуры //-Лико m.shenderov 26.12.2017
